Repository: ls1intum/BinarySpectrum
Catalog: EducationalGame/EducationalGame/Others/Localizable.xcstrings
Source language: en
Languages: de, pt_br

source: Great job! The colors match well!
de: Tolle Arbeit! Die Farben passen gut zusammen!
pt_br: Ótimo trabalho! As cores combinam bem!

# Great job! Your binary armband shows your birthday: %lld.%lld.
source: Great job! Your binary armband shows your birthday: %1$lld.%2$lld.
de: Toll gemacht! Deine binäre Armbinde zeigt deinen Geburtstag: %1$lld.%2$lld.
pt_br: Excelente trabalho! Sua braçadeira binária mostra seu aniversário: %1$lld.%2$lld.

source: Grid Genius
de: Raster-Genie
pt_br: Gênio da Grade

source: Grid Size:
de: Rastergröße:
pt_br: Tamanho da Grade:

source: Haptic Feedback
de: Haptisches Feedback
pt_br: Feedback Tátil

source: Here you can see your progress and achievements. Complete mini-games and challenges to unlock more achievements!
de: Hier kannst du deinen Fortschritt und deine Erfolge sehen. Schließe Mini-Spiele und Herausforderungen ab, um mehr Erfolge freizuschalten!
pt_br: Aqui você pode ver seu progresso e conquistas. Complete mini-games e desafios para desbloquear mais conquistas!

source: Hex codes are a shorthand for RGB values, using base-16 numbers. Each pair of characters represents one color component (red, green, or blue).
de: Hex-Codes sind eine Kurzform für RGB-Werte und verwenden Zahlen zur Basis 16. Jedes Zeichenpaar stellt eine Farbkomponente dar (rot, grün oder blau).
pt_br: Códigos hexadecimais são uma forma abreviada para valores RGB, usando números de base 16. Cada par de caracteres representa um componente de cor (vermelho, verde ou azul).

source: Hexadecimal Colors
de: Hexadezimale Farben
pt_br: Cores Hexadecimais

source: Hey there! I'm Alex, a Data Scientist. I work with numbers to help computers make smart decisions.
de: Hallo! Ich bin Alex, ein Data Scientist. Ich arbeite mit Zahlen, um Computern zu helfen, kluge Entscheidungen zu treffen.
pt_br: Olá! Eu sou Alex, um Cientista de Dados. Trabalho com números para ajudar computadores a tomarem decisões inteligentes.

source: Hi! I'm Iris, a Graphics Programmer. I make colors come alive on screen.
de: Hi! Ich bin Iris, eine Grafikprogrammiererin. Ich lasse Farben auf dem Bildschirm lebendig werden.
pt_br: Oi! Eu sou Iris, uma Programadora Gráfica. Eu faço as cores ganharem vida na tela.

source: Hi! I'm Pixie, a Digital Artist. I create art one pixel at a time.
de: Hi! Ich bin Pixie, eine Digitalkünstlerin. Ich erschaffe Kunst Pixel für Pixel.
pt_br: Oi! Eu sou Pixie, uma Artista Digital. Eu crio arte um pixel de cada vez.

source: How big the color appears
de: Wie groß die Farbe erscheint
pt_br: Quão grande a cor aparece

source: How do computers create colors on a screen?
de: Wie erzeugen Computer Farben auf einem Bildschirm?
pt_br: Como os computadores criam cores em uma tela?

source: How do computers represent images at their most basic level?
de: Wie stellen Computer Bilder auf ihrer grundlegendsten Ebene dar?
pt_br: Como os computadores representam imagens em seu nível mais básico?

source: How see-through the color is
de: Wie durchsichtig die Farbe ist
pt_br: Quão transparente a cor é

source: If a binary number is 101, what decimal number does it represent?
de: Wenn eine Binärzahl 101 ist, welche Dezimalzahl stellt sie dar?
pt_br: Se um número binário é 101, qual número decimal ele representa?

source: If there's a 1 in a spot, we add that value. If there's a 0, we skip it.
de: Wenn an einer Stelle eine 1 steht, addieren wir diesen Wert. Wenn eine 0 steht, überspringen wir ihn.
pt_br: Se houver um 1 em uma posição, adicionamos esse valor. Se houver um 0, pulamos.

source: Image Compression
de: Bildkompression
pt_br: Compressão de Imagem

source: In an 8x8 grid, how many pixels are there in total?
de: Wie viele Pixel gibt es insgesamt in einem 8x8-Raster?
pt_br: Em uma grade 8x8, quantos pixels existem no total?

source: In binary, 1 is followed by 10, which represents the decimal number 2.
de: Im Binärsystem folgt auf 1 die 10, was der Dezimalzahl 2 entspricht.
pt_br: No sistema binário, 1 é seguido por 10, que representa o número decimal 2.

source: In binary, 101 means 1×4 + 0×2 + 1×1 = 5.
de: Im Binärsystem bedeutet 101: 1×4 + 0×2 + 1×1 = 5.
pt_br: No sistema binário, 101 significa 1×4 + 0×2 + 1×1 = 5.

source: In binary, each place value doubles as you move left: 1, 2, 4, 8, 16, and so on.
de: Im Binärsystem verdoppelt sich jeder Stellenwert, wenn du nach links gehst: 1, 2, 4, 8, 16 und so weiter.
pt_br: No sistema binário, cada valor de posição dobra conforme você se move para a esquerda: 1, 2, 4, 8, 16 e assim por diante.

source: In binary, what number comes right after 1?
de: Welche Zahl folgt im Binärsystem direkt nach 1?
pt_br: No sistema binário, qual número vem logo após o 1?

source: In Progress
de: In Bearbeitung
pt_br: Em Progresso

source: In the next challenge, you'll group similar pixels together to store your art more efficiently.
de: In der nächsten Herausforderung wirst du ähnliche Pixel gruppieren, um deine Kunst effizienter zu speichern.
pt_br: No próximo desafio, você agrupará pixels semelhantes para armazenar sua arte de forma mais eficiente.

source: In this game, you'll become a pixel artist and create your own black and white masterpieces.
de: In diesem Spiel wirst du ein Pixelkünstler und erstellst deine eigenen Schwarz-Weiß-Meisterwerke.
pt_br: Neste jogo, você se tornará um artista de pixel e criará suas próprias obras-primas em preto e branco.

source: Instead of storing every single pixel separately, we can find patterns.
de: Anstatt jedes einzelne Pixel separat zu speichern, können wir Muster finden.
pt_br: Em vez de armazenar cada pixel separadamente, podemos encontrar padrões.

source: Instead of: 000011110000 Use: W4B4W4
de: Anstatt: 000011110000 Verwende: W4B4W4
pt_br: Em vez de: 000011110000 Use: W4B4W4

source: Invalid date. Please check if this date exists in the calendar.
de: Ungültiges Datum. Bitte überprüfe, ob dieses Datum im Kalender existiert.
pt_br: Data inválida. Por favor, verifique se esta data existe no calendário.

source: Invalid day. Days should be between 1-31.
de: Ungültiger Tag. Tage sollten zwischen 1-31 liegen.
pt_br: Dia inválido. Os dias devem estar entre 1-31.

source: Invalid month. Months should be between 1-12.
de: Ungültiger Monat. Monate sollten zwischen 1-12 liegen.
pt_br: Mês inválido. Os meses devem estar entre 1-12.

source: It's all about position! Each spot in a binary number has a different value.
de: Es geht alles um die Position! Jede Stelle in einer Binärzahl hat einen anderen Wert.
pt_br: É tudo sobre posição! Cada lugar em um número binário tem um valor diferente.

source: It's like a secret recipe that tells your screen exactly what color to display!
de: Es ist wie ein geheimes Rezept, das deinem Bildschirm genau sagt, welche Farbe angezeigt werden soll!
pt_br: É como uma receita secreta que diz exatamente qual cor sua tela deve exibir!

source: Keep trying! Remember: 1 = black pixel, 0 = white pixel.
de: Versuche es weiter! Denk daran: 1 = schwarzes Pixel, 0 = weißes Pixel.
pt_br: Continue tentando! Lembre-se: 1 = pixel preto, 0 = pixel branco.

source: Keep trying! The 16×16 grid is more challenging, but you can do it! Need help? Try tapping a few more black cells based on the binary code.
de: Versuche es weiter! Das 16×16-Raster ist anspruchsvoller, aber du schaffst das! Brauchst du Hilfe? Versuche, basierend auf dem Binärcode ein paar weitere schwarze Zellen anzutippen.
pt_br: Continue tentando! A grade 16×16 é mais desafiadora, mas você consegue! Precisa de ajuda? Tente tocar em mais algumas células pretas com base no código binário.

source: Less blue.
de: Weniger Blau.
pt_br: Menos azul.

source: Less green.
de: Weniger Grün.
pt_br: Menos verde.

source: Less opacity.
de: Weniger Deckkraft.
pt_br: Menos opacidade.

source: Less red.
de: Weniger Rot.
pt_br: Menos vermelho.

source: Let Alex explain to you how to solve the final challenge.
de: Lass dir von Alex erklären, wie du die letzte Herausforderung lösen kannst.
pt_br: Deixe Alex explicar como resolver o desafio final.

source: Let Alex explain to you how to solve the next challenges.
de: Lass dir von Alex erklären, wie du die nächsten Herausforderungen lösen kannst.
pt_br: Deixe Alex explicar como resolver os próximos desafios.

source: Let Iris explain to you how to solve the first challenge.
de: Lass dir von Iris erklären, wie du die erste Herausforderung lösen kannst.
pt_br: Deixe Iris explicar como resolver o primeiro desafio.

source: Let Pixie explain to you how to solve the final challenge.
de: Lass dir von Pixie erklären, wie du die letzte Herausforderung lösen kannst.
pt_br: Deixe Pixie explicar como resolver o desafio final.

source: Let Pixie explain to you how to solve the next challenges.
de: Lass dir von Pixie erklären, wie du die nächsten Herausforderungen lösen kannst.
pt_br: Deixe Pixie explicar como resolver os próximos desafios.

source: Let's discover how digital colors work and create some amazing effects together!
de: Lass uns entdecken, wie digitale Farben funktionieren und gemeinsam einige erstaunliche Effekte erstellen!
pt_br: Vamos descobrir como as cores digitais funcionam e criar alguns efeitos incríveis juntos!

source: Let's experiment with fading, overlapping, and glowing effects using opacity!
de: Lass uns mit Verblassen, Überlappen und Leuchteffekten experimentieren, indem wir die Deckkraft nutzen!
pt_br: Vamos experimentar com efeitos de desvanecimento, sobreposição e brilho usando opacidade!

source: Let's see what amazing things you can create with this bigger canvas!
de: Lass uns sehen, welche erstaunlichen Dinge du mit dieser größeren Leinwand erstellen kannst!
pt_br: Vamos ver que coisas incríveis você pode criar com esta tela maior!

source: Let's try it out and see how it works!
de: Lass es uns ausprobieren und sehen, wie es funktioniert!
pt_br: Vamos experimentar e ver como funciona!

source: Look at all those pixels! Now for a cool trick that computers use.
de: Schau dir all diese Pixel an! Jetzt kommt ein cooler Trick, den Computer verwenden.
pt_br: Olhe para todos esses pixels! Agora vem um truque legal que os computadores usam.

source: Looking great! Check your work before submitting.
de: Sieht super aus! Überprüfe deine Arbeit, bevor du sie einreichst.
pt_br: Muito bom! Verifique seu trabalho antes de enviar.

source: Manual Settings
de: Manuelle Einstellungen
pt_br: Configuração Manual

source: Match both the color and opacity of the target
de: Passe sowohl die Farbe als auch die Deckkraft des Ziels an
pt_br: Combine tanto a cor quanto a opacidade do alvo

source: Match the target color using the RGB sliders!
de: Passe die Zielfarbe mit den RGB-Schiebereglern an!
pt_br: Combine a cor alvo usando os controles deslizantes RGB!

source: Misterious Color
de: Geheimnisvolle Farbe
pt_br: Cor Misteriosa

source: Month (1-12)
de: Monat (1-12)
pt_br: Mês (1-12)

source: Month: 4 bits (1-12) Day: 5 bits (1-31)
de: Monat: 4 Bits (1-12) Tag: 5 Bits (1-31)
pt_br: Mês: 4 bits (1-12) Dia: 5 bits (1-31)

source: More blue.
de: Mehr Blau.
pt_br: Mais azul.

source: More green.
de: Mehr Grün.
pt_br: Mais verde.

source: More opacity.
de: Mehr Deckkraft.
pt_br: Mais opacidade.

source: More pixels mean higher resolution, allowing the image to show more detail and appear sharper.
de: Mehr Pixel bedeuten eine höhere Auflösung, wodurch das Bild mehr Details zeigen und schärfer erscheinen kann.
pt_br: Mais pixels significam maior resolução, permitindo que a imagem mostre mais detalhes e apareça mais nítida.

source: More pixels means you can add more details to your art.
de: Mehr Pixel bedeutet, dass du mehr Details zu deiner Kunst hinzufügen kannst.
pt_br: Mais pixels significa que você pode adicionar mais detalhes à sua arte.

source: More red.
de: Mehr Rot.
pt_br: Mais vermelho.

source: Multiply by 2
de: Mit 2 multiplizieren
pt_br: Multiplicar por 2

source: Name your pixel art
de: Benenne deine Pixelkunst
pt_br: Nomeie sua arte pixel

source: Not quite right 😕
de: Nicht ganz richtig 😕
pt_br: Não está bem certo 😕

source: Not quite right. Try adjusting the opacity more carefully to reveal all the letters.
de: Nicht ganz richtig. Versuche, die Deckkraft sorgfältiger anzupassen, um alle Buchstaben zu enthüllen.
pt_br: Não está bem certo. Tente ajustar a opacidade com mais cuidado para revelar todas as letras.

source: Not quite! Try comparing the colors more carefully.
de: Nicht ganz! Versuche, die Farben sorgfältiger zu vergleichen.
pt_br: Não está certo! Tente comparar as cores com mais cuidado.

source: Now let's convert binary to decimal! What number is represented by these binary digits?
de: Jetzt lasst uns Binär in Dezimal umwandeln! Welche Zahl wird durch diese Binärziffern dargestellt?
pt_br: Agora vamos converter binário para decimal! Qual número é representado por estes dígitos binários?

source: Now lets represent %lld in binary. For that we need 5 digits!
de: Jetzt stellen wir %lld binär dar. Dafür brauchen wir 5 Stellen!
pt_br: Agora vamos representar %lld em binário. Para isso precisamos de 5 dígitos!

source: Now that you know about RGB colors, here's a cool trick computers use.
de: Jetzt, wo du über RGB-Farben Bescheid weißt, hier ist ein cooler Trick, den Computer verwenden.
pt_br: Agora que você conhece as cores RGB, aqui está um truque legal que os computadores usam.

source: Now try to do the opposite and figure out which number this binary code represents. Remember: each position represents a power of 2: 1, 2, 4, 8, 16.
de: Jetzt versuche das Gegenteil und finde heraus, welche Zahl dieser Binärcode darstellt. Denk daran: Jede Position steht für eine Potenz von 2: 1, 2, 4, 8, 16.
pt_br: Agora tente fazer o oposto e descobrir qual número este código binário representa. Lembre-se: cada posição representa uma potência de 2: 1, 2, 4, 8, 16.

source: Now try to do the opposite by coding the pixel art in binary. Remember: white is 0 and black is 1.
de: Versuche jetzt das Gegenteil, indem du die Pixelkunst in Binärcode umwandelst. Denk daran: Weiß ist 0 und Schwarz ist 1.
pt_br: Agora tente fazer o oposto, codificando a arte pixel em binário. Lembre-se: branco é 0 e preto é 1.

source: Now we're leveling up to a 16×16 grid - that's four times more pixels!
de: Jetzt steigen wir auf ein 16×16-Raster auf - das sind viermal mehr Pixel!
pt_br: Agora estamos subindo de nível para uma grade 16×16 - isso são quatro vezes mais pixels!

source: of April
de: April
pt_br: de Abril

source: of August
de: August
pt_br: de Agosto

source: of December
de: Dezember
pt_br: de Dezembro

source: of February
de: Februar
pt_br: de Fevereiro

source: of January
de: Januar
pt_br: de Janeiro

source: of July
de: Juli
pt_br: de Julho

source: of June
de: Juni
pt_br: de Junho

source: of March
de: März
pt_br: de Março

source: of May
de: Mai
pt_br: de Maio

source: of November
de: November
pt_br: de Novembro

source: of October
de: Oktober
pt_br: de Outubro

source: of September
de: September
pt_br: de Setembro

source: Opacity (Alpha)
de: Deckkraft (Alpha)
pt_br: Opacidade (Alfa)

source: Opacity controls how transparent a color is. Values range from 0.0 (invisible) to 1.0 (solid), allowing you to see through objects.
de: Die Deckkraft steuert, wie transparent eine Farbe ist. Die Werte reichen von 0,0 (unsichtbar) bis 1,0 (undurchsichtig) und ermöglichen es dir, durch Objekte hindurchzusehen.
pt_br: A opacidade controla o quão transparente uma cor é. Os valores variam de 0,0 (invisível) a 1,0 (sólido), permitindo que você veja através dos objetos.

source: Opacity controls how transparent or solid an object appears — higher opacity means less see-through, and lower opacity means more see-through.
de: Die Deckkraft steuert, wie transparent oder undurchsichtig ein Objekt erscheint — höhere Deckkraft bedeutet weniger durchsichtig, und niedrigere Deckkraft bedeutet mehr durchsichtig.
pt_br: A opacidade controla o quão transparente ou sólido um objeto aparece — maior opacidade significa menos transparência, e menor opacidade significa mais transparência.

source: Perfect! You've successfully decoded %@!
de: Perfekt! Du hast %@ erfolgreich entschlüsselt!
pt_br: Perfeito! Você decodificou %@ com sucesso!

source: Perfect! You've successfully decoded the 16×16 image of %@!
de: Perfekt! Du hast das 16×16 Bild von %@ erfolgreich entschlüsselt!
pt_br: Perfeito! Você decodificou com sucesso a imagem 16×16 de %@!

source: Perfect! You've successfully encoded %@ in binary!
de: Perfekt! Du hast %@ erfolgreich in Binärcode umgewandelt!
pt_br: Perfeito! Você codificou %@ em binário com sucesso!

source: Pixel Art
de: Pixel-Kunst
pt_br: Arte em Pixel

source: Pixel Images
de: Pixel-Bilder
pt_br: Imagens de Pixel

source: PixelPrism
de: PixelPrisma
pt_br: PíxelPrisma

source: Powers of 2
de: Potenzen von 2
pt_br: Potências de 2

source: Practice converting decimal numbers to binary. Remember: each position represents a power of 2: 1, 2, 4, 8, 16.
de: Übe die Umwandlung von Dezimalzahlen in Binärzahlen. Denk daran: Jede Position steht für eine Potenz von 2: 1, 2, 4, 8, 16.
pt_br: Pratique a conversão de números decimais para binários. Lembre-se: cada posição representa uma potência de 2: 1, 2, 4, 8, 16.

source: Practice converting decimal numbers to binary. Remember: each position represents a power of 2: 1, 2, 4, 8.
de: Übe die Umwandlung von Dezimalzahlen in Binärzahlen. Denk daran: Jede Position steht für eine Potenz von 2: 1, 2, 4, 8.
pt_br: Pratique a conversão de números decimais para binários. Lembre-se: cada posição representa uma potência de 2: 1, 2, 4, 8.

source: Programmers prefer working with only two digits
de: Programmierer arbeiten lieber mit nur zwei Ziffern
pt_br: Programadores preferem trabalhar com apenas dois dígitos

source: Progress Reset
de: Fortschritt zurücksetzen
pt_br: Redefinição de Progresso

source: Pure Red: (255, 0, 0) Pure Green: (0, 255, 0) Yellow: (255, 255, 0)
de: Reines Rot: (255, 0, 0) Reines Grün: (0, 255, 0) Gelb: (255, 255, 0)
pt_br: Vermelho Puro: (255, 0, 0) Verde Puro: (0, 255, 0) Amarelo: (255, 255, 0)

source: Rainbow
de: Regenbogen
pt_br: Arco-íris

source: Ready to become a pixel-saving wizard? Let's make art that looks awesome AND saves space!
de: Bereit, ein Pixel-sparender Zauberer zu werden? Lass uns Kunst machen, die großartig aussieht UND Speicherplatz spart!
pt_br: Pronto para se tornar um mago economizador de pixels? Vamos fazer arte que pareça incrível E economize espaço!

source: Ready to bring your ideas to life, one pixel at a time? Let's get creative!
de: Bereit, deine Ideen zum Leben zu erwecken, ein Pixel nach dem anderen? Lass uns kreativ werden!
pt_br: Pronto para dar vida às suas ideias, um pixel de cada vez? Vamos ser criativos!

source: Ready to create your own binary code and make something awesome? Let's go!
de: Bereit, deinen eigenen Binärcode zu erstellen und etwas Tolles zu machen? Los geht's!
pt_br: Pronto para criar seu próprio código binário e fazer algo incrível? Vamos lá!

source: Remember: the two first digits represent the red amount, then the green, then the blue. The values go from 00 (weak) to FF (strong).
de: Denk daran: Die ersten beiden Ziffern stellen den Rotanteil dar, dann den Grünanteil, dann den Blauanteil. Die Werte reichen von 00 (schwach) bis FF (stark).
pt_br: Lembre-se: os dois primeiros dígitos representam a quantidade de vermelho, depois o verde, depois o azul. Os valores vão de 00 (fraco) a FF (forte).

source: Reset
de: Zurücksetzen
pt_br: Redefinir

source: Reset Progress
de: Fortschritt zurücksetzen
pt_br: Redefinir Progresso

source: Result
de: Ergebnis
pt_br: Resultado

source: Review what you've learned about binary numbers and their role in computing. Check the boxes that correspond to what you've learned.
de: Überprüfe, was du über Binärzahlen und ihre Rolle in der Informatik gelernt hast. Kreuze die Kästchen an, die dem entsprechen, was du gelernt hast.
pt_br: Revise o que você aprendeu sobre números binários e seu papel na computação. Marque as caixas que correspondem ao que você aprendeu.

source: Review what you've learned about digital colors, hex codes, and opacity. Check the boxes that correspond to what you've learned.
de: Überprüfe, was du über digitale Farben, Hex-Codes und Deckkraft gelernt hast. Kreuze die Kästchen an, die dem entsprechen, was du gelernt hast.
pt_br: Revise o que você aprendeu sobre cores digitais, códigos hexadecimais e opacidade. Marque as caixas que correspondem ao que você aprendeu.

source: Review what you've learned about how images are stored in pixels. Check the boxes that correspond to what you've learned.
de: Überprüfe, was du darüber gelernt hast, wie Bilder in Pixeln gespeichert werden. Kreuze die Kästchen an, die dem entsprechen, was du gelernt hast.
pt_br: Revise o que você aprendeu sobre como as imagens são armazenadas em pixels. Marque as caixas que correspondem ao que você aprendeu.

source: RGB Color Model
de: RGB-Farbmodell
pt_br: Modelo de Cor RGB

source: RGB stands for Red, Green, and Blue - the primary colors of light. By mixing these colors in different amounts, computers can create millions of colors on your screen.
de: RGB steht für Rot, Grün und Blau - die Grundfarben des Lichts. Durch Mischung dieser Farben in verschiedenen Mengen können Computer Millionen von Farben auf deinem Bildschirm erzeugen.
pt_br: RGB significa Vermelho, Verde e Azul - as cores primárias da luz. Misturando essas cores em diferentes quantidades, os computadores podem criar milhões de cores na sua tela.

source: RLE is a way to compress binary images by counting consecutive pixels of the same color.
de: RLE ist eine Methode, um Binärbilder zu komprimieren, indem aufeinanderfolgende Pixel derselben Farbe gezählt werden.
pt_br: RLE é uma forma de comprimir imagens binárias contando pixels consecutivos da mesma cor.

source: Rookie
de: Neueinsteiger
pt_br: Novato

source: Rotate the opacity volume button to decypher the hidden message and write it on the text field.
de: Drehe den Deckkraft-Regler, um die versteckte Nachricht zu entschlüsseln und schreibe sie in das Textfeld.
pt_br: Gire o botão de volume de opacidade para decifrar a mensagem oculta e escreva-a no campo de texto.

source: Row 1: 00000000 Row 2: 00011000 Row 3: 00111100
de: Zeile 1: 00000000 Zeile 2: 00011000 Zeile 3: 00111100
pt_br: Linha 1: 00000000 Linha 2: 00011000 Linha 3: 00111100

source: Run-Length Encoding
de: Lauflängenkodierung
pt_br: Codificação por Comprimento de Execução

source: Save
de: Speichern
pt_br: Salvar

source: Save Changes
de: Änderungen speichern
pt_br: Salvar Alterações

source: Select a number to see its binary representation
de: Wähle eine Zahl, um ihre binäre Darstellung zu sehen
pt_br: Selecione um número para ver sua representação binária

source: Select the color that matches the given RGB-alpha value!
de: Wähle die Farbe, die zum angegebenen RGB-Alpha-Wert passt!
pt_br: Selecione a cor que corresponde ao valor RGB-alfa fornecido!

source: Settings
de: Einstellungen
pt_br: Configurações

source: Shapes and animations
de: Formen und Animationen
pt_br: Formas e animações

source: Skip
de: Überspringen
pt_br: Pular

source: Skip this value
de: Diesen Wert überspringen
pt_br: Pular este valor

source: So how do we make numbers using only 0s and 1s?
de: Wie bilden wir also Zahlen nur mit 0en und 1en?
pt_br: Então, como formamos números usando apenas 0s e 1s?

source: Solid Blue: rgba(0,0,255,1.0) Semi-transparent: rgba(0,0,255,0.5) Invisible: rgba(0,0,255,0.0)
de: Volles Blau: rgba(0,0,255,1.0) Halbtransparent: rgba(0,0,255,0.5) Unsichtbar: rgba(0,0,255,0.0)
pt_br: Azul Sólido: rgba(0,0,255,1.0) Semi-transparente: rgba(0,0,255,0.5) Invisível: rgba(0,0,255,0.0)

source: Sound Effects
de: Sound-Effekte
pt_br: Efeitos Sonoros

source: Sound Settings
de: Toneinstellungen
pt_br: Configurações de Som
